/**
 * https://leetcode-cn.com/problems/minimum-insertions-to-balance-a-parentheses-string/
 * 1541.平衡括号字符串的最少插入次数
 * 难度：中等
 * 
 * 给你一个括号字符串 s ，它只包含字符 &#39;(&#39; 和 &#39;)&#39; 。一个括号字符串被称为平衡的当它满足：
 * 
 * 任何左括号 &#39;(&#39; 必须对应两个连续的右括号 &#39;))&#39; 。
 * 左括号 &#39;(&#39; 必须在对应的连续两个右括号 &#39;))&#39; 之前。
 * 
 * 比方说 "())"， "())(())))" 和 "(())())))" 都是平衡的， ")()"， "()))" 和 "(()))" 都是不平衡的。
 * 
 * 你可以在任意位置插入字符 &#39;(&#39; 和 &#39;)&#39; 使字符串平衡。
 * 
 * 请你返回让 s 平衡的最少插入次数。
 * 
 * 示例 1：
 * 输入：s = "(()))"
 * 输出：1
 * 解释：第二个左括号有与之匹配的两个右括号，但是第一个左括号只有一个右括号。我们需要在字符串结尾额外增加一个 &#39;)&#39; 使字符串变成平衡字符串 "(())))" 。
 * 
 * 示例 2：
 * 输入：s = "())"
 * 输出：0
 * 解释：字符串已经平衡了。
 * 
 * 示例 3：
 * 输入：s = "))())("
 * 输出：3
 * 解释：添加 &#39;(&#39; 去匹配最开头的 &#39;))&#39; ，然后添加 &#39;))&#39; 去匹配最后一个 &#39;(&#39; 。
 * 
 * 示例 4：
 * 输入：s = "(((((("
 * 输出：12
 * 解释：添加 12 个 &#39;)&#39; 得到平衡字符串。
 * 
 * 示例 5：
 * 输入：s = ")))))))"
 * 输出：5
 * 解释：在字符串开头添加 4 个 &#39;(&#39; 并在结尾添加 1 个 &#39;)&#39; ，字符串变成平衡字符串 "(((())))))))" 。
 * 
 * 提示：
 * 1 <= s.length <= 10^5
 * s 只包含 &#39;(&#39; 和 &#39;)&#39; 。
 */

/**
 * @param {string} s
 * @return {number}
 */
var minInsertions = function(s) {

};

// Local test
let assert = require("assert");
console.time("Time cost");

assert.deepEqual(minInsertions("param"), "expect", "Case 1");
assert.deepEqual(minInsertions("param"), "expect", "Case 2");

console.log("Good job! We have passed all test case.");
console.timeEnd("Time cost");
